{
  "zh-tw": "中文",
  "en": "English",
  "common": {
    "about_me": "About",
    "projects": "Work",
    "market": "OwlTing Market E-Commerce Platform",
    "pms": "OwlNest Admin System",
    "owlting_website": "OwlTing Official Website",
    "re_branding": "Rebranding",
    "website": "Redesign",
    "app": "App",
    "ux_research": "UX Research",
    "ui_design": "UI Design",
    "b2b": "B2B",
    "saas": "SaaS",
    "user_testing": "User testing",
    "refactor_website": "Refactor Website",
    "official_website": "Official Website",
    "lear_more_cta": "View the case study",
    "project_includes": "Project Includes",
    "project_scale": "Project Scale",
    "my_role": "My Role",
    "project_background": "Project Background",
    "challenges": "Challenges and Solutions",
    "uiux_designer": "UI/UX Designer",
    "prototype_cta": "View Prototype",
    "more_project": "More Works",
    "view_project_cta": "View Project"
  },
  "page_elevator": {
    "overview": "Overall",
    "goal": "Goals",
    "empathize": "Empathize",
    "define": "Define",
    "ideate": "Ideate",
    "design": "Design",
    "result": "Result",
    "iterate": "Iterate",
    "app": "APP",
    "takeaway": "Takeaway"
  },
  "meeting": {
    "title": "Hey ! Thanks for visit my website, Feel free to chat with me ! ⭐ "
  },
  "home": {
    "title_1": "I'm a UI/UX Designer with basic coding skill.",
    "title_2": "I like to solve problems via the most suitable design. 🌟",
    "title_mobile": "I'm a UI/UX Designer with basic coding skill, I like to solve problems via the most suitable design. 🌟",
    "market": {
      "description": "Redesign OwlTing Market e-commerce platform and through cross-departmental cooperation of rebranding."
    },
    "pms": {
      "description": "Optimal OwlNest pricing function to achieve rapid and flexible setting experience."
    },
    "official_website": {
      "description": "Redesigning website experiences, the goal is show more structured information to user."
    }
  },
  "market_project": {
    "title": "Redesign OwlTing Market E-Commerce Platform ",
    "project_scale_answer": "5 departments, 15 members",
    "project_background_answer": "OwlTing Market is a e-commerce platform which dedicated to promoting Taiwanese brands with 2,000+ local partners.<br />However,<span class='text-md-bold'>the website is not responsive and page layout is not conform to user's browsing habit, these inefficient browsing experience cause high bounce rate and low conversion rate,</span><br/> Department manager reported that our website often been criticized by usability and security,<span class='text-md-bold'> which cause team member to lost confidence in the product.</span>",
    "overview": {
      "challenges_title1": "Website structure is complicated to refactor",
      "challenges_answer1": "In this refactoring we adjust not only the UX flow and front-end framework, but also involves back-end date structure, which made this refactoring become very complicated. So in early stage I discussed the revision scale with engineers through information architecture, in the end we decided iterate by pages.",
      "challenges_title2": "Having different opinion with CEO",
      "challenges_answer2": "REMOVE THE BANNER SECTION ! This is how CEO said about homepage, in his opinion the huge carousel waste the most important section of web page and user often ignore them. I verified the situation by google analytics and heat-maps. Eventually I designed four-segment banner layout to reach an effective promotional information.",
      "results": "Let's see the results first 👀",
      "results_answer1": "New Users",
      "results_answer2": "Avg. Session Duration",
      "results_answer3": "Bounce Rate"
    },
    "goal": {
      "title": "The problems we'd solve",
      "goal1": "Redesign a responsive e-commerce platform, and must consider experience of existing users.",
      "goal2": " Carry out rebranding by cross departmental",
      "goal3": "Through e-commerce platform to helping local partners promote products ."
    },
    "empathize": {
      "title": "Understand our user",
      "subtitle1": "I. User interview",
      "text1": "I conducted one-on-one interviews with different level members <span class='text-md-bold'>to understand users pain point and their expectation.</span>",
      "user_ordinary": "Member",
      "user_premiere": "Premier member",
      "user_manager": "Sales manager",
      "user_talk1": "The webpage is difficult to browse form desktop. Usually I use search bar to find the items, really hope there has some product info on homepage.",
      "user_talk2": "It's inconvenience of can't track shipping status.",
      "user_talk3": "Hope category bar can be clearly, also banners section is too small to notice.",
      "user_talk4": "When meeting with clients it's embarrassed by showing our non support responsive web page , and the tiny banners cause low conversion rates. I'll do my best to support this revision!",
      "subtitle2": "II. User journey map",
      "text2": "Based on user interviews, data analysis, we depict a customer-journey map.<span class='text-md-bold'>We use this persona to shared understanding,</span> so we're all thinking and referring in the same way with our user."
    },
    "define": {
      "title": "Identify current problems",
      "text1": "<span class='text-md-bold'>Non-responsive web design</span> - Based on 80% of our visited came from mobile devices, mobile first is the right decision at the beginning, however non-responsive desktop webpage cause an unpleasant browse experience .",
      "text2": "<span class='text-md-bold'>Information is unstructured</span> - User can't find any product information at home page, also small banners can't capture user's attention.",
      "text3": "<span class='text-md-bold'>Lack of brand  identity</span> - We hope to bring organic food, healthy lifestyle for our consumers, however the website is lack of brand identity so it's hard to convey our spirit to customers."
    },
    "ideate":{
      "title": "Ideate brand identity",
      "text": "In brainstorming <span class='text-md-bold'>we base on brand sprity 'Stay Simple, Stay Humble' to ideate brand identity, </span> which also includes color patterns and photo style, we want to create a brand with healthy, local and friendly."
    },
    "design": {
      "title": "Optimization and discussion ",
      "subtitle1": "I. Information architecture",
      "text1": "After a few rounds of evaluation as a team,<span class='text-md-bold'>we agreed to iterate by pages.</span><br>In the IA picture the bright outlines are new pages and others are pages need to be redesigned. Furthermore, I marked the number for each, it will be easily to discuss.",
      "subtitle2": "II. Wireframe",
      "talking_bubble1": "Remove Banners !",
      "talking_bubble2": "Whaa... Which e-commerce platform has no banners ?<br/> Isn't it the way that user use to ?",
      "text2": "This story happen when I was planning homepage, <span class='text-md-bold'>CEO has opposite opinion with user habit. </span>After discussed I knew that in his opinion the huge carousel waste the most important section of web page. And I verified the situation by google analytics and heat-maps.<span class='text-md-bold'><br/>Eventually I designed four-segment banner layout to reach an effective promotional information.</span><span class='text-md-bold'></span>",
      "subtitle3": "III. Design System",
      "text3": "Via the branding identity I define design system to maintain product consistency.<br/>💡 : UI kits must include component state, and micro animation if it needed. It can helps engineers clarify elements and reduce modify repeatedly.",
      "subtitle4": "IV. Prototype",
      "text4": "Before launch we invited our coworkers who also is OwlTing market user to conduct user task,<span class='text-md-bold'> based on screen recording and heatmap analysis to modify web layout and ensure our origin users have delightful experience.</span>"
    },
    "result": {
      "title": "Page Display",
      "text": "This revision is carried out by pages iterated. <span class='text-md-bold'>As of October 2021, the design revision has been completed 100%; the engineering implementation has been completed 80%.</span>",
      "mockup_title1": "Homepage browsing",
      "mockup_text1": "According to user's preference to arrange website content",
      "mockup_title2": "Navbar category",
      "mockup_text2": "Category is been ordered by users preference.",
      "mockup_title3": "Category page browsing",
      "mockup_text3": "Optimize hover effect to provide an ease user experience.",
      "mockup_title4": "404 page",
      "mockup_text4": "I reconsider 404 page, is can be not only a page to showed info but also can provide useful contents for user to keep browsing."
    },
    "iterate": {
      "title": "Via data to optimize",
      "text": "Tracking data shows that<span class='text-md-bold'> Banner section has increased CTR, and verify keep navbar for user is the right decision.</span><br><span class='text-md-bold'>Also, we uphold the user-centered principle to adjusted page sections, </span>after that we found data shows that the users has batter browsing experiences and brings more CTR."
    },
    "app": {
      "title": "Product caused by COVID",
      "text": "OwlTing Market APP is produced by increased online shopping sales due to the outbreak of COVID-19 in May 2021.<span class='text-md-bold'> It was instructed to develop with high efficiency and unchanged current users experiences as the goal.</span>"
    },
    "takeaway": {
      "title": "Feedbacks are opportunity for optimization",
      "text1": "<span class='text-md-bold'>Break the rules - </span>Without using carousel for banners it was a challenge for me, however it also helped me to explore a new way for design.",
      "text2": "<span class='text-md-bold'>I feel the most when I'm also the target audience - </span>In the project, I'm not only the UI/UX designer but also a user. From rebranding to development, it is the most precious experience for me. I feel so proud when I saw our product can truly help local farmers."
    }
  },
  "pms_project": {
    "title": "Design pricing function for OwlNest admin system",
    "project_scale_answer": "2 departments, 8 members",
    "project_background_answer": "OwlNest is a B2B property management system for hospitality, clients all over Asian and the United States.<br/>However, the pricing function was been planned in the early stage of the system is relatively simple and cannot achieve effective and flexible price setting.<span class='text-md-bold'> In recent year it's hard to satisfy our new users from hotel.</span>。",
    "overview": {
    "challenges_title1": "It's hard to talk with end users",
    "challenges_answer1": "In this project, our users feedbacks were always been bought by sales, UI/UX designer rarely have opportunity to interview end users. To resolve this problem, I interviewed our colleagues in OwlStay ( OwlTing house brand of hostels ), to understand the real pain points of end users.",
    "challenges_title2": "Having different opinion with product consultant",
    "challenges_answer2": "In the early stage of discussion, our product consultant proposed to renovate the existing process at once, but consider of user experience I insisted not affecting the current users, for emphasize my opinion I made a simple Prototype to convince product consultant.",
    "results": "Let's see feedbacks first 👀",
    "results_answer1": "New price setting function is super useful for a long-term setting !",
    "result_owner1": "- User from Taipei",
    "results_answer2": "Holiday price setting is convenient and flexible ! Love it so much !",
    "result_owner2": "- User from Hualien",
    "results_answer3": "Compared to other systems, holiday setting is our unique selling point !",
    "result_owner3": "- Sales manager"
    },
    "goal": {
      "title": "The pain points we'd  solve",
      "goal1": "Development a suitable price setting function for all users.",
      "goal2": "Optimize current interface according to users feedback, make sure new function and exist function coexist in the system.",
      "goal3": "Flexible and effective price setting for holiday."
    },
    "empathize": {
      "title": "Understand users using patterns",
      "text": "<span class='text-md-bold'>I interview with OwlS stay front desk team, and referred feedbacks of the other users.</span> I learned that user usually set weekday and weekend price first, and than set holiday price, some hotels referred neighboring countries holiday.",
      "step1": "Weekday",
      "step2": "Weekend",
      "step3": "Holiday",
      "step4": "Others"
    },
    "define": {
      "title": "Existing pain point",
      "text": "The negative common we received the most is<span class='text-md-bold'> room price only can be set one by one, complicated and repetitive operations are easily cause wrong result.</span>"
    },
    "ideate": {
      "title": "Brainstorming for optimize task",
      "subtitle1": "I. Analyze current steps",
      "text1": "<span class='text-md-bold'>Current room prices only can be set one by one,</span> in the situation of multiple room types and multiple projects it will increase multiple times, which is a great burden for user.",
      "subtitle2": "II. Find the steps for optimization",
      "text2-1": "<span class='text-md-bold'> Simplify repeat steps - </span>Through user interviews I know that <span class='text-md-bold'>most users setting price start from room type, then adjust the price according to different projects. </span>So if we can simplify repeated steps, it would be easier for user to operate.",
      "text2-2": "<span class='text-md-bold'> Easily select national holidays - </span>In current interface it provides information for national holidays, but user cannot see it when setting room price. So we optimized date drop-down and planned the new setting function for national holidays.",
      "description": "Repeated steps are marked with same colors.",
      "subtitle3": "III. Steps after optimized",
      "text3": "Multi-select prices can be set by periods of date in the most effective way. <span class='text-md-bold'>The example shows the new way saves 4.5 times operation.</span>"
    },
    "design": {
      "title": "Transform text flow into interfaces",
      "subtitle1": "I. Wireframe",
      "text1": "After discussing the optimization flow with our team, I transform text flows into wireframe, and discuss with engineers to modification.",
      "subtitle2": "II. Reuse the UI library",
      "text2": "<span class='text-md-bold'>Admin system should pays more attention to user's process of completing tasks than the visual style.</span> To avoid increase user's learning cost I used existing elements to design and keep the consistency.",
      "subtitle3": "III. Prototype",
      "text3": "Prototype can achieve high fidelity, also I through it to observed users operation and interaction with interfaces.",
      "text3-2": "According to this project is charged admin system, please forgive me can't provide an interact Prototype. 🙇‍♀️ "
    },
    "result": {
      "title": "Page Display",
      "text": "The new pricing function allows users to make multiple combinations of room types and sale plans. It was planned in tab which can easily switch with existing calendar and not change the original layout.<span class='text-md-bold'> We launch this new function in the calmest way without disturbing user.</span>",
      "mockup_title1": "Setting multiple price plans",
      "mockup_text1": "It simplify repeated steps, it would be easier for user to operate.",
      "mockup_title2": "Quickly setting holidays price",
      "mockup_text2": "User can directly select national holidays, through interface to solve the burden of user's memory.",
      "mockup_title3": "Optimize dropdown calendar",
      "mockup_text3": "The national holidays are also displayed on the drop-down calendar, so user can always pay attention of pricing."
    },
    "iterate": {
      "title": "According to users feedback to optimize",
      "text": "New function brings lots of comments from users, they're satisfied with multiple select pricing which also can save lots of manpower. Those positive feedbacks are promote the second stage optimization."
    },
    "takeaway": {
      "title": "Design admin system should be more careful",
      "text": "When planning new functions for admin system, in my opinion the most important thing is follow existing users experiences.<span class='text-md-bold'> Normally users don't like changes, so when planning new function, we should try not to affect the operation of existing users as the highest principle.</span>"
    }
  },
  "official_web_project": {
    "title": "Redesign OwlTing Official Website",
    "project_scale_answer": "13 departments, 20 members",
    "rd_project_owner": "RD team project owner",
    "project_background_answer": "OwlTing group was founded in 2010, with blockchain in core. Its has seven product lines, including B2B business services, B2B hotel management service, B2C e-commerce platforms and hotels, ect.<br/> Current website is not reserve flexibility for update, <span class='text-md-bold'> so it's hard to convey our new information to users.</span> In addiction, <span class='text-md-bold'> the old visual style is different with new VI system, </span>all the reasons contributed the website revision.",
    "overview": {
      "challenges_title1": "Launch schedule is greatly advanced",
      "challenges_answer1": "On the eve of the  Chinese Festival holiday, I received multilingual function which has been planed in phase two has to ahead of schedule, so I immediately recruited meetings of departments to request support, we use shortest time to completed and delivered on schedule.",
      "results": "Let's see feedbacks first 👀",
      "results_answer1": "I'm very proud of sharing our new website with other companies",
      "result_owner1": "- C-level colleague",
      "results_answer2": "Job applicants said that official website introduction is very clear !",
      "result_owner2": "- HR colleague",
      "results_answer3": "When the media came to interview, we felt that they had a better understanding of our.",
      "result_owner3": "- PR colleague"
    },
    "goal": {
      "title": "What we want to achieve",
      "goal1": "Refactored from the information architecture, allowing users to obtain information more easily.",
      "goal2": "Cross departments to integrate products introduction, clearly convey our solutions for user.",
      "goal3": "According to group VI system to define new style for website, let it be outstanding from high-tech industry."
    },
    "empathize": {
      "title": "Clarify demand and current problems",
      "text": "The demand originated from CEO, so the team is more cautious when implement tasks.<span class='text-md-bold'> In this project I'm acting as UI/UX designer and project owner of engineer team. </span><br>I obtained users feedbacks from interviews with colleagues and users.",
      "user_talk1": "Our website is been mocked by competitors.",
      "user1":"Colleague A",
      "user_talk2": "I felt embarrassed to share our official website with my friends.",
      "user2":"Colleague B",
      "user_talk3": "Website structure is not flexible and it will be difficult to expand and update.",
      "user3":"Colleague C",
      "user_talk4": "Reporters couldn't find the newest information on our official website.",
      "user4":"Colleague D",
      "user_talk5": "The timeline of media reports has ten years ! It's barely can browse !",
      "user5":"User A",
      "user_talk6": "So... after browsing your official website, I still can't understand what does your company do.",
      "user6":"User B"
    },
    "define": {
      "title": "Identify current problems",
      "text1": "<span class='text-md-bold'>Unclear products introduction - </span>Narrow narrative and external links can't provide enough information for user.",
      "text2": "<span class='text-md-bold'>Poor interface layout - </span>Unwell-designed pages cause poor user experience.",
      "text3": "<span class='text-md-bold'>Website structure has no flexible - </span>Website structure is old and there is no admin system for maintain.",
      "text4": "<span class='text-md-bold'>Inconsistency user interface - </span>Website style is different with new VI system, which make brand identity is hard to shape."
    },
    "ideate": {
      "title": "Brainstorming for new ideas",
      "text": "In the brainstorming discussion, engineers were also participated, so we discussed the practicality of interaction. Although I know it might be too early to discuss implement at this stage, but it also can a creativity for design."
    },
    "design": {
      "title": "The sooner to discuss, the sooner goes ease",
      "subtitle1": "I. Information architecture",
      "text1": "I reported the revision scale with engineer team and confirming Information architecture. Due to the urgency of this project, the team decide to implement in phases.",
      "subtitle2": "II. Wirefram",
      "text2": "This project is involve with various departments and language translation, <span class='text-md-bold'> so I realize the sooner wireframe is completed ,the entire project will goes smoother.</span>",
      "subtitle3": "III. Existing Visual Elements",
      "text3": "Owls and tech blues are present throughout the entire group VI system. These are a few visual examples that helped me extend baseline for further exploration.",
      "subtitle4": "IV. Exploration",
      "text4": "<span class='text-md-bold'>' High-Technology, Expertise, Product Diversity '</span> are the three cores that I ideated website visual style.",
      "core1": "Technology",
      "core2": "Expertise",
      "core3": "Diversity",
      "idea1": "Ideate from colors",
      "idea2": "Ideate from product diversity",
      "subtitle5": "V. Iterations",
      "text5": "There is no ' perfect ' for iteration, however balanced with concise and professionalism is consensus, so I made an iteration to optimal page style.",
      "subtitle6": "VI. Prototype",
      "text6": "I used Adobe Xd to simulate parallax scrolling effect for engineer. Operable prototype can easily help engineer to understand tasks.",
      "subtitle7": "VII. Assist engineers to find errors",
      "text7": "Before product launch I assist engineers to debug, such as multi-language pages, various devices, mobile platforms, social media preview etc.<br>💡 : I always compress pictures before deliver to engineers. It can helps them reduce workload."
    },
    "result": {
      "title": "Page Display",
      "mockup_title1": "Homepage",
      "mockup_text1": "Through flying owl concept to display product diversity, it's very attractive.",
      "mockup_title2": "Business introduction section",
      "mockup_text2": "The service type is bring out by narratives and background images which can help user quickly understand.",
      "mockup_title3": "Location presence animation",
      "mockup_text3": "Via animation to express globalization."
    },
   "takeaway": {
     "title": "Archive is as important as create",
     "text": "This revision is very successful. We got many compliments by unique visual style and clear introductions.<br/> However, I should archived comprehensively before the revision, which I will definitely pay attention next time."
   }
  },
  "about_page": {
    "text": "I'm a UI/UX designer with basic coding skill. I have design experiences in B2C e-commerce platform, B2B SaaS system, official website.",
    "text2":"I value design logic and like to explore the core behold problems, those helping me deliver the solution which fit user's mental model.",
    "view_resume_cat": "View Resume",
    "language":{
      "title":"I can speak",
      "ZH":"Chinese",
      "ZH-description":"Native Speaker",
      "EN":"English",
      "EN-description":"As an exchange student in Switzerland, communicate in English throughout the year",
      "FR":"French",
      "FR-description":"Upper-intermediate level, DELF B1 certification"
    },
    "steps": {
      "title": "Working experience",
      "web_designer": "Graphic Web Designer",
      "visual_designer": "Graphic Designer",
      "eu_bachelor": "EU Bachelor's degree",
      "cd":"Commercial Design",
      "owlting": "OwlTing Group",
      "shopee": "Shopee pte ltd",
      "the_diner": "the Diner",
      "epac": "EPAC Switzerland <br/> The Academy of Contemporary Arts",
      "mcu": "Ming Chuan University"
    },
    "skill_tree": {
      "title": "My Skill Tree",
      "learning": "learning"
    },
    "nngroup": {
      "title":"NNgroup reader, lover",
      "text": "NNgroup is like my UI/UX design mentor, also I was sharing '10 Usability Heuristics' in our engineers sharing conference."
    },
    "obsidian": {
      "title": "Love use Obsidian to made Zettelkasten method",
      "text":"I use Obsidian to note what I have learned, and apply Zettelkasten method to disassemble and reconnect the knowledge, which helps me to think multi-dimensionally from a higher-level."
    }
  }
}
